en_us({
	"basicInfo": {
		"name": "Su Xiaoguang ♂ male",
		"title": "☆ Web/JS Engineer ☆ Systems Architect ☆ Devolopment Manager",
		"profileInfo": "I have great interested in science, physics and math since I was a girl. I still remember the first time I play computer in junior middle school, that made me excited. I began programming in senior middle school, I love it and determined to be a engineer in the future and I did. After graduating from the department of computer science and technology, luoyang institute of technology in 2013, I have been focusing on the development and research of front-end fields. I learned a lot from the practices and I enjoyed it. As the saying goes, where there is a will, there is a way. Although there are seven years since I work, I know there still has a long way to go, and I am trying to be a better programmer.",
		"email": "2253745861@qq.com",
		"mobile": "1821502006",
		"website": "https://xguang1226.github.io/my_resume/",
		"authorTitle": "Author",
		"authorValue": "Su Xiaoguang",
		"sourceCode": "Source Code"
	},
	"experiences": {
		"navTitle": "Experiences",
		"sectionTitle": "Experiences",
		"workExperiences": [{
			"place": "Cloud chain technology.（300-500人）",
			"location": "Beijing",
			"title": "Web/JS architect R&D",
			"industry": "Block chain/Service Taijivider",
			"time": "2019.7 — Present",	
			"jobDesc": "As the head of the front end, participate in the development of ZOS project, explained as Supply Taijicedure Optimize. The system based on UWB wireless location technology, aim to build the intelligent factory, optimize plant production process, ensure daily production plant equipment production line can be comprehensive management and monitoring. In the process of project development, to participate in the project system to adjust and optimize the structure design, standardizing the development processes of the team, participate in relevant to the needs of research and discussion, to complete the design and encoding of function modules, coordinate between products, development and testing work. Organize and participate in primary technology research and major obstacles. And if necessary, we also need go to the customer site to offer the related technical support and consultation and help the customer to use the system better."
		}, {
			"place": "Beijing can tong world network technology company.（50-150人）",
			"location": "Beijing",
			"title": "Web/JS architect R&D",
			"industry": "Online Service/Cloud/SaaS",
			"time": "2016.10—2019.7",
			"jobDesc": "As the system architect of pro cloud platform, is responsible for architecture design, research and analysis of related products, collaborative product manager of the demand, form and lead the product development team to complete system development, arrange project development plan, to control the progress of system development, coordination of product development and testing team to work efficiently, lead and guide the team of key technologies and major obstacles to overcome."
		}, {
			"place": "Guanglianda group.（1000-3000人）",
			"location": "Beijing",
			"title": "Web/JS Engineer R&D",
			"industry": "Internet/Cloud/SaaS",
			"time": "2013.10—2016.9",
			"jobDesc": "As the front end development engineer of the company, I presided over the research and analysis of the front end EE rapid development platform, organized the team members to complete the preliminary demand research of the front end EE rapid development platform of Nerpa, the overall product planning, system architecture design, product function research and development, and the final construction and release of the product. Led and organized the research and development team, committed to the development of a powerful, beautiful interface, easy to configure, easy to maintain, easy to expand, user-friendly, excellent performance of visual JAVA EE rapid development platform, ultimately reduce the development cost, reduce the technical threshold of developers."
		}]
	},
	"projects": {
		"navTitle": "Projects",
		"sectionTitle": "Projects",
		"projectEnv": "environment",
		"projectDesc": "Project Description",
		"responsibilityDesc": "Responsibility",
		"projectExperiences": [{
			"name": "ZOS Lending",
			"location": "Beijing",
			"title": "Web/JS architect R&D",
			"industry": "Block chain/Service Taijivider",
			"time": "2019.7 — Present",	
			"env": "Vue.js + Element + Spring Boot + Spring Cloud + Mybatis + RabbitMQ + Docker + Maven + Jenkins…",	
			"desc": "ZOS Lending based on wireless location technology of UWB, provide scheduling dashboard, manager and monitor service of the production line. The system was separated by front and backend, communicate with JSON format. Using HTML5 front page, with the data binding framework simplifies the development of Angular JS, using Spring MVC + Spring + Mybatis backend architecture based on Spring, using Spring Boot to simplify the system configuration, Spring Cloud to support the micro service, to provide a best online API documents with Swagger.",
			"responsibility": "As a project architect, involved in the project system to adjust and optimize the structure design, participate in relevant to the needs of research and discussion, to complete the design and encoding related function modules, organize and participate in primary technology research and major obstacles."
		}, {
			"name": "Taiji Cloud Platform",
			"location": "Beijing",
			"title": "Web/JS architect R&D",
			"industry": "Online Service/Cloud/SaaS",
			"time": "2016.10—2019.7",
			"env": "IDEA + Angular JS + Spring Boot + Spring MVC + Mybatis + FastDFS + Docker + Maven + Jenkins…",	
			"desc": "Taiji Cloud platform is a cloud platform focused on aerospace, ship transportation, rail transportation and other large industries, aiming to provide full range of needs management, transaction management, project management, task collaboration, industry information and other services. The system used separation style between front and backend.The system was separated by front and backend, communicate with JSON format. Using pure HTML5 front page, with the Angular JS data binding framework to simplify the development, backend using Mainstream Architecture with Spring + Spring MVC Mybatis + Shiro, using the Maven project construction, using Jenkins to provide the continuous integration, using FastDFS to meet the needs of attachment and images, deployment using Docker container technology, to the simplify the deployment work.",
			"responsibility": "As the system architect of pro cloud platform, is responsible for architecture design, research and analysis of related products, collaborative product manager of the demand, form and lead the product development team to complete system development, arrange project development plan, to control the progress of system development, coordination of product development and testing team to work efficiently, lead and guide the team of key technologies and major obstacles to overcome."
		}, {
			"name": "Songshan Rapid JAVA EE Develop Platform",
			"location": "Beijing",
			"title": "Web/JS Engineer R&D",
			"industry": "Internet/Cloud/SaaS",
			"time": "2013.10—2016.9",	
			"env": "Eclipse + GEF + EMF + HTML5 + EXT JS + Spring MVC + Spring + Mybatis + Dubbo + Maven + Jenkins…",	
			"desc": "Songshan JAVA EE rapid development platform is based on Eclipse RCP platform. It can quickly generate concise, easy to use, efficient and robust JAVA platform for business development based on simple visual configuration and modeling. The platform architecture with designer and runtime, the designer is a visual modeling designer based on the Eclipse platform can be completed including data modeling, business modeling, UI modeling, and menu modeling, the runtime is a JAVA EE system based on the excellent business. The function modules can be added by designer generated, which greatly reduces the threshold of development, reduce the cost of development.",
			"responsibility": "As the Department's Develop Manager, control the development of Songshan JAVA EE rapid platform. Carry out research and analysis of related products, completed the product planning, product research and development, and hold on the product construction and release. In the process of R & D, we carry out related technology research, overcome technical barriers, participate in the design and development of product functions, coordinate the internal work, track the progress of product development, and ensure the efficiency and quality of product development."
		}]
	},
	"education": {
		"navTitle": "Education",
		"sectionTitle": "Education",
		"educations": [{
			"educationBody": "Luoyang Institute of Science and Technology",
			"degree": "College/Bachelor",
			"time": "2009 - 2013",
			"desc": "Study at Luoyang Institute of Science and Technology and got my Bachelor degree."
		}, {
			"educationBody": "Puyang oilfield second senior high school",
			"degree": "Senior Middle School Stuent",
			"time": "",
			"desc": "Study at Puyang oilfield second senior high school and graduated."
		}, {
			"educationBody": "Puyang city eight primary and secondary schools",
			"degree": "Junior Middle School Stuent",
			"time": "",
			"desc": "Study at Puyang city eight primary and secondary schools and graduated."
		}]
	},
	"skills": {
		"navTitle": "Skills",
		"sectionTitle": "Professional Skills",
		"topSkills": [{
			"name": "WEB/JavaScript",
			"percent": "98",
			"level": "Expert, 5+ years",
			"time": "2016 - Present",
			"desc": "desc here."
		}, {
			"name": "APP/React-Native",
			"percent": "97",
			"level": "Expert, 4+ years",
			"time": "2016 - Present",
			"desc": "desc here."
		}, {
			"name": "Vue/Jquery/React",
			"percent": "95",
			"level": "Expert, 3+ years",
			"time": "2016 - Present",
			"desc": "desc here."
		}],
		"otherSkills": [{
			"name": "HTML5"
		}, {
			"name": "CSS3"
		}],
		"skillItems": [{
			"name": "☆ Familiar with W3C standards, familiar with HTML, CSS, familiar with page architecture and layout, able to quickly and accurately restore design drawings, able to solve common browser compatibility problems, familiar with box model, web semantic and front-end performance optimization."
		}, {
			"name": "☆ Software: Photoshop, Sublime, WebStorm, IntelliJ IDEA and other editors; Be able to design and develop web special effects independently and have good aesthetic ability."
		}, {
			"name": "☆ Proficient in jQuery library, vue. js, acts. js, JSON, prototype object, prototype chain, scope chain, closure, with a certain object-oriented programming ideas. Familiar with ES6, React-Native and other similar MVVM frameworks, familiar with the Mac platform development environment, understand WeChat terminal APP development."
		}, {
			"name": "☆ Familiar with Phonegap, APICloud, Hybird, CSS3, Zepto. Js in H5 APP, understand querymobile, and have high learning enthusiasm for new technologies."
		}, {
			"name": "☆ Familiar with modular development, can independently complete the front-end framework packaging and component preparation, JS script to achieve the special effects of the site."
		}, {
			"name": "☆ Familiar with adaptive layout and responsive layout principle of mobile terminal, can develop common and responsive pages, and can also develop mobile terminal projects."
		}, {
			"name": "☆ Proficient in using Ajax for front and background data interaction, have a good understanding of Ajax cross-domain issues, and adapt to the completion of front and background separate development."
		}, {
			"name": "☆ Able to quickly locate, analyze and solve bugs feedback from testing department and update product requirements."
		}, {
			"name": "☆ Have a deep understanding of user experience, interactive operation process and user needs."
		}, {
			"name": "☆ MySQL, Oracle and other databases, Mongo DB and No SQL, and master Redis and other caching technologies and RabbitMQ and other messaging middleware."
		}, {
			"name": "☆ Familiar with agile development mode, have rich experience and deep understanding of agile development, have good experience in agile team building and cultivation."
		}]
	},
	"portfolio": {
		"navTitle": "Portfolio",
		"sectionTitle": "Portfolio",
		"categories": [{
			"name": "backend",
			"title": "Back-end",
			"desc": "Back-end"
		}, {
			"name": "frontend",
			"title": "Front-end",
			"desc": "Front-end"
		}],
		"portfolios": [{
			"img": "assets/images/portfolio/ployun.png",
			"title": "taiji cloud",
			"category": "backend",
			"technique": "Java",
			"desc": "A cloud platform for traffic and transportation industry.",
			"url": "http://www.ployun.cn/"
		}, {
			"img": "assets/images/portfolio/portfolio-1.jpg",
			"title": "kitty [Open Source]",
			"category": "backend",
			"technique": "Java",
			"desc": "Auth Mng System base on Spring Boot and Spring Cloud.",
			"url": "https://gitee.com/liuge1988/kitty"
		}, {
			"img": "assets/images/portfolio/portfolio-2.jpg",
			"title": "* * Technology [Open Source]",
			"category": "frontend",
			"technique": "Vue.js",
			"desc": "Auth Mng System web base on Vue.js and Element UI.",
			"url": "https://github.com/XGuang1226/vue_manage_demo"
		}, {
			"img": "assets/images/portfolio/portfolio-3.jpg",
			"title": "my_resume [Open Source]",
			"category": "frontend",
			"technique": "Vue.js",
			"desc": "Help designer and programmer build a brilliant online resume.",
			"url": "https://github.com/XGuang1226/my_resume"
		}, {
			"img": "assets/images/portfolio/portfolio-4.jpg",
			"title": "Huashan System",
			"category": "backend",
			"technique": "Java",
			"desc": "supply optimize system base uwb and scan technology.",
			"url": "http://139.196.87.48:9002/kitty"
		}, {
			"img": "assets/images/portfolio/portfolio-5.jpg",
			"title": "Songshanshaolin",
			"category": "backend",
			"technique": "Java",
			"desc": "Java EE GUI Modeling Platform, modeling is devoloping.",
			"url": "http://139.196.87.48:9002/kitty"
		}, {
			"img": "assets/images/portfolio/portfolio-6.jpg",
			"title": "Liumai Visual Platform",
			"category": "backend",
			"technique": "Java",
			"desc": "Domain Modeling Platform, customize GUI Modleing Tools.",
			"url": "https://gitee.com/liuge1988/brilliant"
		}, {
			"img": "assets/images/portfolio/portfolio-7.jpg",
			"title": "Songshans WLAN",
			"category": "backend",
			"technique": "Java",
			"desc": "A WLAN device management and monitor java system.",
			"url": "https://gitee.com/liuge1988/brilliant"
		}]
	},
	"contact": {
		"navTitle": "Contact",
		"sectionTitle": "Get in Touch",
		"notice": "Welcome to my home page. I am working for a software company and often to be bussy with jobs. If you have any meets or questions, please touch me with the following ways.",
		"message": "Drop me a line at",
		"call": " or call me at",
		"thanks": "，thanks for visit.",
		"provideServices": "I can help with the following：",
		"services": [{
			"name": "Served as a CTO, handling the system devolopment and team mamagement."
		}, {
			"name": "To be a Architect, handling software devolopment and do teamwork."
		}, {
			"name": "As a Dev Manager, handling  software devolopment and do teamwork."
		}, {
			"name": "To be a PM, doing project management and make good practice in teamwork."
		}]
	}
})
